NikolayBobovnikov/ircapture/auvir_embed/mocap/transmitter/stm32f103/Src/main.c
                // transitional state
                // TODO: check if possible to move to beginning of next state (thus remove delay)
                case STAGE_ON2:
                {
                    htim3.Instance->ARR = PeriodBetweenDataFrames;
                    StartStopSequenceTransmitState = STAGE_0;
                    TransmitterState = TX_DELAY;
                    break;
                }
            }
            break;
        }
        case TX_DELAY:
        {
            htim3.Instance->ARR = PeriodOfStartStopBits;
            StartStopSequenceTransmitState = STAGE_0;
            TransmitterState = TX_WAITING_FOR_TRANSMISSION;

            break;
        }
    } // switch(TransmitterState)
}
void receive_handler()
{
    ccr1 = htim4.Instance->CCR1;
    ccr2 = htim4.Instance->CCR2;

    if(ind < 100)
    {
        pwm[ind] = ccr1;
        pwm[ind + 1] = ccr2;
        if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
        {
            if(level_ind < 100)
            {
                level[ind] = 1;
                level[ind + 1] = 1;
            }
        }
    }
    else
    {
        int a = 0;
        ind = 0;
    }
    ind = ind + 2;

    /*
    if (ind == 0)
    {
        array[ind] = ccr1;
        ccr1_tn = ccr1_tn_1;
    }
    if(ind < 100)
    {
        //If CCRx_tn < CCRx_tn+1: capture = CCRx_tn+1 - CCRx_tn
        if(ccr1_tn < ccr1_tn_1)
        {
            array[ind] = ccr1_tn_1 - ccr1_tn;
        }
        //If CCRx_tn > CCRx_tn+1: capture = (ARR_max - CCRx_tn) + CCRx_tn+1
        else
        {
            array[ind] = htim4.Instance->ARR - ccr1_tn + ccr1_tn_1;
        }
    }
    else
    {
        int a = 0;
        ind = 0;
    }
    ind++;

    */

    /* Receive data frame
     * 1. start sequence
     * 2. data
     *  2.1 Coded angle
     *  2.2 Time of emission
     *  2.3 Beamer ID
     * 3. data redundancy (repeated, or use error correction code)
     * 4. stop sequence
     *
     * Check data integrity. If OK, data is received
     */

    /* 1. Waiting for start bit
     * 2. Input capture channel: rising edge detected. Start timer, wait 1/2 of period
     * 3. 1/2 period check: if signal is high, start bit is received, goto 4, otherwise stop timer, goto 1
     * 4. 1/2 + i period check: read timer signal, increment received bits count
     * 5. If rbc == total_bits, wait for stop bit
     * 6. Check stop bit: if signal is high, stop timer, save received data, update event (?), goto 1
     *
     */
    switch(ReceiverState)
    {
        case RX_WAITING_FOR_START_BIT:
        {
            if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
            {
              if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) !=RESET)
              {
                  htim4.Instance->ARR = HalfPeriodOfStartStopBits;
                  ReceiverState = RX_START_BIT_SENDING;
                  StartStopSequenceReceiveState = STAGE_0;
                  // wait for half a period of startstop bit sequence
              }
            }
            break;
        }
        case RX_START_BIT_SENDING:
        {
            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceReceiveState)
            {
                //High confirmed: STAGE_0 -> STAGE_ON1
                case STAGE_0:
                {
                    // Timer4 Input Channel 1 mapped to PB6

                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET) //high level is confirmed, continue reading start sequence
                    {
                        htim4.Instance->ARR = PeriodOfStartStopBits;
                        StartStopSequenceTransmitState = STAGE_ON1;
                    }
                    else  // in the start sequence current level should be high, reset the state
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                    //Low: STAGE_ON1 -> STAGE_OFF
                case STAGE_ON1:
                {
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET) //current level is low, continue reading start sequence
                    {
                        StartStopSequenceTransmitState = STAGE_OFF;
                    }
                    else // in the start sequence current level should be low, reset the state
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                    //High: STAGE_OFF -> STAGE_ON2
                case STAGE_OFF:
                {
                    //if current level is high, reading start sequence is done
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                    {
                        // what remains now before data is HalfPeriodOfStartStopBits ticks of high level,
                        // then PeriodOfStartStopBits ticks of low level

                        StartStopSequenceTransmitState = STAGE_ON2;
                    }
                    else // in the start sequence current level should be high, reset the state
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }
                // transitional state
                // TODO: check if possible to move to beginning of next state (thus remove delay)
                case STAGE_ON2:
                {
                    // final "delay" before data
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
                    {
                        // from now on, data will come after HalfPeriodOfStartStopBits ticks
                        //htim4.Instance->ARR = HalfPeriodOfStartStopBits;

                        //TODO: check that current level is low?
                        //reset StartStopSequenceState
                        StartStopSequenceTransmitState = STAGE_0;
                        // move on to the next receiver state
                        //ReceiverState = RX_START_BIT_SENT;
                        ReceiverState = RX_DATA_RECEIVING;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    break;
                }

